using System.Collections;
using System.Xml;

static class CustomerFactory
{
    public static Customer Randomize()
    {
        Dictionary<int, string> fullnameDic = new Dictionary<int, string>()
        {
            { 0, "Михаил" },
            { 1, "Александр" },
            { 2, "Артем" },
            { 3, "Лев" },
            { 4, "Матвей" },
            { 5, "Тимофей" },
            { 6, "Иван" },
            { 7, "Максим" },
            { 8, "Марк" },
            { 9, "Роман" },
            { 10, "София" },
            { 11, "Анна" },
            { 12, "Мария" },
            { 13, "Ева" },
            { 14, "Варвара" },
            { 15, "Виктория" },
            { 16, "Милана" },
            { 17, "Алиса" },
            { 18, "Полина" },
            { 19, "Ксения" },
        };

        Dictionary<int, Address> addressDic = new Dictionary<int, Address>()
        {
            { 0, new Address(410196, "Россия", "г. Саратов", "ул. Октябрьская", "10", "оф. 77") },
            { 1, new Address(190958, "Россия", "г. Санкт-Петербург", "ул. Западная", "3", "оф. 70") },
            { 2, new Address(394058, "Россия", "г. Воронеж", "ул. 8 Марта", "35", "оф. 53") },
            { 3, new Address(344307, "Россия", "г. Ростов-на-Дону", "ул. Юбилейная", "49", "оф. 1") },
            { 4, new Address(614360, "Россия", "г. Пермь", "ул. Пушкина", "29", "оф. 95") },
            { 5, new Address(190027, "Россия", "г. Санкт-Петербург", "ул. Шоссейная", "28", "оф. 61") },
            { 6, new Address(630671, "Россия", "г. Новосибирск", "ул. Новая", "14", "оф. 83") },
            { 7, new Address(400250, "Россия", "г. Волгоград", "ул. Шоссейная", "24", "оф. 93") },
            { 8, new Address(450783, "Россия", "г. Уфа", "ул. Чапаева", "43", "оф. 9") },
            { 9, new Address(410727, "Россия", "г. Саратов", "ул. Советская", "42", "оф. 24") },
            { 10, new Address(454445, "Россия", "г. Челябинск", "ул. Горького", "34", "оф. 43") },
            { 11, new Address(350436, "Россия", "г. Краснодар", "ул. Солнечная", "20", "оф. 62") },
            { 12, new Address(350527, "Россия", "г. Краснодар", "ул. Клубная", "11", "оф. 55") },
            { 13, new Address(625629, "Россия", "г. Тюмень", "ул. Новая", "41", "оф. 18") },
            { 14, new Address(420156, "Россия", "г. Казань", "ул. Свободы", "28", "оф. 29") },
            { 15, new Address(625797, "Россия", "г. Тюмень", "ул. Родниковая", "49", "оф. 70") },
            { 16, new Address(410688, "Россия", "г. Саратов", "ул. Колхозная", "13", "оф. 14") },
            { 17, new Address(125926, "Россия", "г. Москва", "ул. Фрунзе", "13", "оф. 3") },
            { 18, new Address(454679, "Россия", "г. Челябинск", "ул. Гоголя", "37", "оф. 65") },
            { 19, new Address(625916, "Россия", "г. Тюмень", "ул. 8 Марта", "2", "оф. 97") },
        };

        Random random = new Random();

        Customer customer = new Customer(fullnameDic[random.Next(0, 20)], addressDic[random.Next(0, 20)]);
        return customer;
    }
}