using System.Collections;
using System.Xml;

static class CustomerFactory
{
    public static Customer Randomize()
    {
        Dictionary<int, string> fullnameDic = new Dictionary<int, string>()
        {
            { 0, "Михаил" },
            { 1, "Александр" },
            { 2, "Артем" },
            { 3, "Лев" },
            { 4, "Матвей" },
            { 5, "Тимофей" },
            { 6, "Иван" },
            { 7, "Максим" },
            { 8, "Марк" },
            { 9, "Роман" },
            { 10, "София" },
            { 11, "Анна" },
            { 12, "Мария" },
            { 13, "Ева" },
            { 14, "Варвара" },
            { 15, "Виктория" },
            { 16, "Милана" },
            { 17, "Алиса" },
            { 18, "Полина" },
            { 19, "Ксения" },
        };

        Dictionary<int, string> addressDic = new Dictionary<int, string>()
        {
            { 0, "410196, г. Саратов, ул. Октябрьская, 10, оф. 77" },
            { 1, "190958, г. Санкт-Петербург, ул. Западная, 3, оф. 70" },
            { 2, "394058, г. Воронеж, ул. 8 Марта, 35, оф. 53" },
            { 3, "344307, г. Ростов-на-Дону, ул. Юбилейная, 49, оф. 1" },
            { 4, "614360, г. Пермь, ул. Пушкина, 29, оф. 95" },
            { 5, "190027, г. Санкт-Петербург, ул. Шоссейная, 28, оф. 61" },
            { 6, "630671, г. Новосибирск, ул. Новая, 14, оф. 83" },
            { 7, "400250, г. Волгоград, ул. Шоссейная, 24, оф. 93" },
            { 8, "450783, г. Уфа, ул. Чапаева, 43, оф. 9" },
            { 9, "410727, г. Саратов, ул. Советская, 42, оф. 24" },
            { 10, "454445, г. Челябинск, ул. Горького, 34, оф. 43" },
            { 11, "350436, г. Краснодар, ул. Солнечная, 20, оф. 62" },
            { 12, "350527, г. Краснодар, ул. Клубная, 11, оф. 55" },
            { 13, "625629, г. Тюмень, ул. Новая, 41, оф. 18" },
            { 14, "420156, г. Казань, ул. Свободы, 28, оф. 29" },
            { 15, "625797, г. Тюмень, ул. Родниковая, 49, оф. 70" },
            { 16, "410688, г. Саратов, ул. Колхозная, 13, оф. 14" },
            { 17, "125926, г. Москва, ул. Фрунзе, 13, оф. 3" },
            { 18, "454679, г. Челябинск, ул. Гоголя, 37, оф. 65" },
            { 19, "625916, г. Тюмень, ул. 8 Марта, 2, оф. 97" },
        };

        Random random = new Random();

        int fullnameNumber = random.Next(0, 20);
        int addressNumber = random.Next(0, 20);

        Customer customer = new Customer(fullnameDic[fullnameNumber], addressDic[addressNumber]);
        return customer;
    }
}